#include <stdio.h>
/**
 * 自增与自减的区别
 * @return
 */
int main() {
    // 定义变量
    int a = 10, b = 20, c = 30, d = 40;
    // 变量操作
    int a1 = ++a, b1 = b++, c1 = --c, d1 = d--;

    // 输出结果
    // a1=++a,先执行++a，结果为11，再将11赋值给a1，所以a1的最终值为11。而a经过自增,最终的值也为11
    printf("a=%d, a1=%d\n", a, a1);

    // b1=b++，b的值并不会立马加1，而是先把b原来的值交给b1，然后再加1.
    printf("b=%d, b1=%d\n", b, b1);

    // 先执行--c，结果为 29，再将29 赋值给c1
    printf("c=%d, c1=%d\n", c, c1);

    // d的值并不会立马减1，而是先把d原来的值交给d1，然后再减 1
    printf("d=%d, d1=%d\n", d, d1);
    return 0;
}